"use strict";
// Задача 1: Постфиксная и префиксная формы

// Чему будут равны переменные a, b, c и d в примере ниже?
let a = 1,
  b = 1;
let c = ++a; // 2
let d = b++; // 1
// a = b = 2

// Задача 2: Результат присваивания

// Чему будут равны переменные k и x после исполнения кода в примере ниже?

let k = 2;
let x = 1 + (a *= 2);
// k = 4; x = 5

// Задача 3: Преобразование типов

// Какой результат будет у выражений ниже?

// "" + 1 + 0     <-- '10'
// "" - 1 + 0     <-- '-1'
// true + false   <-- '1'
// 6 / "3"        <-- '2'
// "2" * "3"      <-- '6'
// 4 + 5 + "px"   <-- '9px'
// "$" + 4 + 5    <-- '$45'
// "4" - 2        <-- '2'
// "4px" - 2      <-- 'NaN'
// "  -9  " + 5   <-- ' -9 5'
// "  -9  " - 5   <-- '-14'
// null + 1       <-- '1'
// undefined + 1  <-- 'NaN'
// " \t \n" - 2   <-- '-2'

// Задача 4: Исправьте сложение

// Ниже приведён код, который запрашивает у пользователя два числа и показывает их сумму.
// Он работает неправильно. Код в примере выводит 12 (для значения полей по умолчанию).
// В чём ошибка? Исправьте её. Результат должен было 3.

let y = prompt("Первое число?", 1);
let z = prompt("Второе число?", 2);

alert(y + z); // 12
alert(+y + +z); // 3
